STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_HeartRate_ota/Core/Inc/app_conf.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    app_conf.h
  * @author  MCD Application Team
  * @brief   Application configuration file for STM32WPAN Middleware.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APP_CONF_H
#define APP_CONF_H

/* Includes ------------------------------------------------------------------*/
#include "hw_if.h"
#include "stm32_adv_trace.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/******************************************************************************
 * Application Config
 ******************************************************************************/
/**< generic parameters ******************************************************/

/**
 * Define Tx Power
 */
#define CFG_TX_POWER                      (0x19) /* 0x19 <=> -0.3 dBm */

/**
 * Define Advertising parameters
 */
#define CFG_ADV_BD_ADDRESS                (0x000000000000)
#define CFG_BLE_ADDRESS_TYPE              GAP_PUBLIC_ADDR /**< Bluetooth address types defined in ble_defs.h */

#define ADV_INTERVAL_MIN                  (0x0080)
#define ADV_INTERVAL_MAX                  (0x00A0)
#define ADV_LP_INTERVAL_MIN               (0x0640)
#define ADV_LP_INTERVAL_MAX               (0x0FA0)
#define ADV_TYPE                          ADV_IND
#define ADV_FILTER                        NO_WHITE_LIST_USE

/**
 * Define IO Authentication
 */
#define CFG_BONDING_MODE                 (1)
#define CFG_FIXED_PIN                    (111111)
#define CFG_USED_FIXED_PIN               (0)
#define CFG_ENCRYPTION_KEY_SIZE_MAX      (16)
#define CFG_ENCRYPTION_KEY_SIZE_MIN      (8)

/**
 * Define IO capabilities
 */
#define CFG_IO_CAPABILITY_DISPLAY_ONLY        (0x00)
#define CFG_IO_CAPABILITY_DISPLAY_YES_NO      (0x01)
#define CFG_IO_CAPABILITY_KEYBOARD_ONLY       (0x02)
#define CFG_IO_CAPABILITY_NO_INPUT_NO_OUTPUT  (0x03)
#define CFG_IO_CAPABILITY_KEYBOARD_DISPLAY    (0x04)

#define CFG_IO_CAPABILITY                     CFG_IO_CAPABILITY_DISPLAY_YES_NO

/**
 * Define MITM modes
 */
#define CFG_MITM_PROTECTION_NOT_REQUIRED      (0x00)
#define CFG_MITM_PROTECTION_REQUIRED          (0x01)

#define CFG_MITM_PROTECTION                   CFG_MITM_PROTECTION_REQUIRED

/**
 * Define Secure Connections Support
 */
#define CFG_SECURE_NOT_SUPPORTED              (0x00)
#define CFG_SECURE_OPTIONAL                   (0x01)
#define CFG_SECURE_MANDATORY                  (0x02)

#define CFG_SC_SUPPORT                        CFG_SECURE_OPTIONAL

/**
 * Define Keypress Notification Support
 */
#define CFG_KEYPRESS_NOT_SUPPORTED            (0x00)
#define CFG_KEYPRESS_SUPPORTED                (0x01)

#define CFG_KEYPRESS_NOTIFICATION_SUPPORT     CFG_KEYPRESS_NOT_SUPPORTED

/**
 * Numeric Comparison Answers
 */
#define YES (0x01)
#define NO  (0x00)

/**
*   Identity root key used to derive LTK and CSRK
*/
#define CFG_BLE_IRK     {0x12, 0x34, 0x56, 0x78, 0x9A, 0xBC, 0xDE, 0xF0, 0x12, 0x34, 0x56, 0x78, 0x9A, 0xBC, 0xDE, 0xF0}

/**
* Encryption root key used to derive LTK and CSRK
*/
#define CFG_BLE_ERK     {0xFE, 0xDC, 0xBA, 0x09, 0x87, 0x65, 0x43, 0x21, 0xFE, 0xDC, 0xBA, 0x09, 0x87, 0x65, 0x43, 0x21}

/* USER CODE BEGIN Generic_Parameters */
/**
 * Define PHY
 */
#define ALL_PHYS_PREFERENCE                             (0x00)
#define RX_2M_PREFERRED                                 (0x02)
#define TX_2M_PREFERRED                                 (0x02)
#define TX_1M                                           (0x01)
#define TX_2M                                           (0x02)
#define RX_1M                                           (0x01)
#define RX_2M                                           (0x02)
/* USER CODE END Generic_Parameters */

/**< specific parameters */
/*****************************************************/

/* USER CODE BEGIN Specific_Parameters */
  /*  L2CAP Connection Update request parameters used for test only with smart Phone */
#define L2CAP_INTERVAL_MIN              CONN_P(1000) /* 1s */
#define L2CAP_INTERVAL_MAX              CONN_P(1000) /* 1s */
#define L2CAP_SLAVE_LATENCY             (0x0000)
#define L2CAP_TIMEOUT_MULTIPLIER        (0x1F4)

/**
* AD Element - DEV ID
*/
#define CFG_DEV_ID_OTA_FW_UPDATE                (0x86)

/**
* AD Element - Group B Feature
*/
/* LSB - First Byte */
#define CFG_FEATURE_OTA_SW                      (0x08)

/* LSB - Second Byte */
#define CFG_FEATURE_OTA_REBOOT                  (0x20)

/**
 * Define the NVM and STATIC size in sector
 */
#define CFG_NVM_STATIC_NB_SECTORS                          (4)
/**
 * Define the User Configuration size in sector
 */
#define CFG_USER_CFG_NB_SECTORS                            (1)
/**
 * Define the start address where the User Configuration shall be located
 */
#define CFG_USER_CFG_SLOT_START_SECTOR_INDEX             (FLASH_PAGE_NB - CFG_NVM_STATIC_NB_SECTORS - CFG_USER_CFG_NB_SECTORS)
/**
 * Define the start address where the application shall be located
 */
#define CFG_ACTIVE_SLOT_START_SECTOR_INDEX                 (2)
/**
 * Size in Page of Download and Active slots
 */
#define CFG_DOWNLOAD_ACTIVE_NB_SECTORS              (FLASH_PAGE_NB - CFG_NVM_STATIC_NB_SECTORS - CFG_USER_CFG_NB_SECTORS)
/**
 * Size in Page of Download or active slot
 */
#define CFG_APP_SLOT_PAGE_SIZE            ((CFG_DOWNLOAD_ACTIVE_NB_SECTORS - CFG_ACTIVE_SLOT_START_SECTOR_INDEX) / 2)
/**
 * Define the start address where the NEW application shall be downloaded
 */
#define CFG_DOWNLOAD_SLOT_START_SECTOR_INDEX    (CFG_APP_SLOT_PAGE_SIZE + CFG_ACTIVE_SLOT_START_SECTOR_INDEX)

#define CFG_OTA                       (1)

/**
 * Define list of reboot reason
 */
#define CFG_REBOOT_ON_FW_APP          (0x00)
#define CFG_REBOOT_ON_BLE_OTA_APP     (0x01)
#define CFG_REBOOT_ON_CPU2_UPGRADE    (0x02)

/**
 * Define mapping of OTA messages in SRAM
 */
#define CFG_OTA_REBOOT_VAL_MSG            (*(uint8_t*)(SRAM1_BASE+0))
#define CFG_OTA_START_SECTOR_IDX_VAL_MSG  (*(uint8_t*)(SRAM1_BASE+1))
#define CFG_OTA_NBR_OF_SECTOR_VAL_MSG     (*(uint8_t*)(SRAM1_BASE+2))
/* USER CODE END Specific_Parameters */

